app/controllers/sessions_controller.rb

  def create
    if !require_captcha? || simple_captcha_valid?
      @member = Member.from_auth(auth_hash)
    end

    if @member
      if @member.disabled?
        increase_failed_logins
        # redirect_to signin_path, alert: t('.disabled')
        redirect_to :back
      else
        clear_failed_logins
        reset_session rescue nil
        session[:member_id] = @member.id
        save_session_key @member.id, cookies['_peatio_session']
        @member.last_signin_ip = request.ip
        @member.save
---
UPDATE `members` SET `last_signin_ip` = '127.0.0.1', `updated_at` = '2016-11-07 11:07:23' WHERE `members`.`id` = 1