app/controllers/private/funds_controller.rb

    def index
      @notification = Notification.where(active: true).first
---
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`active` = 1 ORDER BY `notifications`.`id` ASC LIMIT 1

    def gen_address
      current_user.accounts.each do |account|
        next if account.currency_obj.nil? || (not account.currency_obj.coin?)

        if account.payment_addresses.blank?
---
SELECT `payment_addresses`.* FROM `payment_addresses` WHERE `payment_addresses`.`account_id` = 1