app/controllers/private/markets_controller.rb

SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`active` = 1 ORDER BY `notifications`.`id` ASC LIMIT 1
---
    def show
      @bid = params[:bid]
      @ask = params[:ask]

      @market        = current_market
      @markets       = Market.all.sort
      @market_groups = @markets.map(&:quote_unit).uniq

      @bids   = @market.bids
      @asks   = @market.asks
      @trades = @market.trades

      # default to limit order
      @order_bid = OrderBid.new ord_type: 'limit'
      @order_ask = OrderAsk.new ord_type: 'limit'

      set_member_data if current_user

      if current_user
        @notification = Notification.where(active: true).first

SELECT `orders`.* FROM `orders` WHERE `orders`.`member_id` = 1 AND `orders`.`currency` = 4 AND `orders`.`state` = 100
---
    def set_member_data
      @member = current_user
      @orders_wait = @member.orders.with_currency(@market).with_state(:wait)